Examinator/src/InformationRegisters/ПроведениеПодчиненныхМероприятийСУО/ПроведениеПодчиненныхМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПроведениеПодчиненныхМероприятийСУО</name>
  <attributes>
    <name>Номер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.АудиторииСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляУчастника</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляМенеджера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресВИнтернете</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DocumentRef.ПроведениеОбученияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Мероприятие</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СхемаПроведения</name>
    <type>
      <types>CatalogRef.СхемыМероприятийСУО</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/МестаПроведенияМероприятийСУО/МестаПроведенияМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>МестаПроведенияМероприятийСУО</name>
  <enumValues>
    <name>Аудитория</name>
  </enumValues>
  <enumValues>
    <name>Дистанционно</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/InformationRegisters/ПроведениеПодчиненныхМероприятийСУО/RecordSetModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбменДанными.Загрузка
		И ЭтотОбъект.Количество() = 1 Тогда
		
		Мероприятие = ЭтотОбъект[0].Мероприятие;
		
		Если Мероприятие.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория
			И НЕ ЗначениеЗаполнено(ЭтотОбъект[0].Аудитория) Тогда
			
			Текст = НСтр("ru = 'Укажите аудиторию проведения занятия ""%1"" мероприятия ""%2"".'");
			Текст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Текст, Мероприятие, ЭтотОбъект[0].ПроведениеОбучения.Мероприятие);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			
		КонецЕсли;
		
		Если (Мероприятие.МестоПроведения = Перечисления.МестаПроведенияМероприятийСУО.Аудитория ИЛИ НЕ Мероприятие.Вид.Электронное)
			И НЕ ЗначениеЗаполнено(ЭтотОбъект[0].ДатаПроведения) Тогда
			
			Текст = НСтр("ru = 'Укажите дату проведения мероприятия'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
			
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры
